"""Корабельные команды
Необходимо разделить всех моряков на 2 команды по следующим правилам: те, кто
старше 40 лет или моложе 20 лет, должен быть на первом корабле, а все остальные - на
втором. Это поможет молодым морякам приобрести опыт старших коллег.
Входными данными будет: n - количество строк с информацией о членах команды
далее n строк, содержащих фамилии моряков и их возраст.
Выход: После формирования экипажей необходимо отсортировать всех матросов в
алфавитном порядке в каждом списке фамилий.
4
Smith 34
Wesson 22
Coleman 45
Abrahams 19
Команда 1: Abrahams, Coleman
Команда 2: Smith, Wesson
"""

