"""
В известной игре Эрудит каждой букве соответствует определенное количество очков.
Общая сумма очков, которую получает игрок, составивший это слово, складывается из
очков за каждую букву, входящую в его состав. Чем более употребимой является буква в
языке, тем меньше очков начисляется за ее использование. Ниже приведены все
соответствия букв и очков из английской версии игры.
Напишите программу, рассчитывающую и отображающую количество очков за собранное
слово. Создайте словарь для хранения соответствий между буквами и очками и
используйте его в своем решении.
"""